[{"content":"\n<p>A switch statement is a control flow statement that allows a program to execute a block of code from among several alternatives. It consists of a control expression followed by one or more case labels, and an optional default label. Here is an example of a switch statement:</p>\n\n\n<div class=\"wp-block-syntaxhighlighter-code \"><pre class=\"brush: java; gutter: false; title: ; quick-code: false; notranslate\" title=\"\">\nint day = 3;\n\nswitch (day) {\n  case 1:\n    System.out.println(\"Monday\");\n    break;\n  case 2:\n    System.out.println(\"Tuesday\");\n    break;\n  case 3:\n    System.out.println(\"Wednesday\");\n    break;\n  default:\n    System.out.println(\"Invalid day\");\n    break;\n}\n</pre></div>\n\n\n<p>On the other hand, a switch expression is a concise way of writing a switch statement that returns a value. It was introduced in Java 14 as a preview language feature, and it became a standard language feature in Java 15. Here is the same example as above, rewritten using a switch expression:</p>\n\n\n<div class=\"wp-block-syntaxhighlighter-code \"><pre class=\"brush: java; gutter: false; title: ; quick-code: false; notranslate\" title=\"\">\nint day = 3;\n\nString dayString = switch (day) {\n  case 1 -&gt; &quot;Monday&quot;;\n  case 2 -&gt; &quot;Tuesday&quot;;\n  case 3 -&gt; &quot;Wednesday&quot;;\n  default -&gt; &quot;Invalid day&quot;;\n};\n\nSystem.out.println(dayString);\n</pre></div>\n\n\n<p>One of the main differences between a switch statement and a switch expression is that the switch expression returns a value, whereas the switch statement does not. In the switch expression example above, the value of the <strong>dayString </strong>variable will be <strong>&#8220;Wednesday&#8221;</strong>, because that is the value returned by the switch expression.</p>\n\n\n\n<p>Another difference is that the case labels in a switch expression can be expressions, whereas in a switch statement they must be constant values. This allows for more flexibility in the types of values that can be used in a switch expression.</p>\n\n\n\n<p>Finally, the syntax for a switch expression is more concise than the syntax for a switch statement. For example, the -&gt; symbol is used to separate the case label from the case body, and the break statement is not needed at the end of each case.</p>\n","createdAt":"2023-01-02T00:39:55","excerpt":"<p>A switch statement is a control flow statement that allows a program to execute a block of code from among several alternatives. It consists of a control expression followed by one or more case labels, and an optional default label. Here is an example of a switch statement: On the other hand, a switch expression [&hellip;]</p>\n","id":"switch-expression-statement-in-java","slug":"switch-expression-statement-in-java","title":"Switch Expression  &amp; Statement in&nbsp;Java","modified":"2023-01-02T04:49:56","featuredImage":"https://arslanmushtaq.files.wordpress.com/2023/01/java-01-fi.jpg"},{"content":"\n<p>If you&#8217;re working remotely for a company, let me help you upgrade with some of the tips I have managed to learn over the last 4 years of remote work.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Remote work is awesome, eh? Yeah, it is but companies do not trust easily when it comes to remote work. Companies always keep a keen eye on employees during their probation period because a company needs output and an employer needs more than a salary which is a professional environment and stuff which is self-developed when it comes to remote jobs.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Start of the day</h2>\n\n\n\n<p>You used to go office due to which you used to wake up early to exercise, have breakfast, take a shower and run for the office but now you&#8217;re working remotely. You just wake up, open the laptop and start working which is the worst thing to do. Don&#8217;t change your routine just because now you don&#8217;t need to rush towards the office.</p>\n\n\n\n<p>Wake up, do your exercise, have breakfast, take a shower and then open your laptop to start your professional day. You don&#8217;t need to be just mentally ready for the job, you need to be physically ready too because that will exercise your mind to understand that I am still in the same routine and you still have a job that is as serious as the one in the office.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Environment</h2>\n\n\n\n<p>The most important thing to consider while working remotely is the environment. If you don&#8217;t have an environment and you sit on your bed and work professionally, then I can promise you that you will see yourself in bed without a job within a month. The reason why I say that is because being too comfortable in a remote job is the same as being too comfortable in the office.</p>\n\n\n\n<p>If you have a spare room, use that. Build your workspace, put up a monitor, buy a computer table, and a comfortable chair, and act like you&#8217;re the boss of the room. Building an environment will encourage you on a different level and will also build a sense of responsibility.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Take breaks</h2>\n\n\n\n<p>Are you continuously sitting for 8 hours and thinking you&#8217;ve done a great job of not letting your focus break? No, you&#8217;ve done a lot worse to yourself, it is important to have a break from whatever your job is. It is important to understand that our mind also needs rest from the continuous traumatizing of logic building, solving problems, understanding complexities and so much more.</p>\n\n\n\n<p>After every 50 or 55 minutes of work take a 5 to 10 minutes pause and try to calm yourself during that free time. Within your 8 hours, you&#8217;re entitled to an hour break during which you can do anything else than work. Talk to your friends, sit with your family, have lunch, have tea or do something refreshing. Let your colleagues know that you&#8217;re not a robot.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Communication is the key</h2>\n\n\n\n<p>At your workspace, always communicate. Don&#8217;t ever make mistakes like informing at the last hour that you&#8217;ll not be joining tomorrow due to a reason which you knew could pop up a long time ago. Communicate the task, holidays, solutions, or problems with the respective person you&#8217;re appointed to. Try to discuss via email rather than social media applications or verbally. This is one of the main crucial parts of a remote job. </p>\n\n\n\n<p>All of your colleagues should be on the same page when it comes to you. Else than an emergency, you should be pre-planned about your job and respective personnel should be updated.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Never be personal</h2>\n\n\n\n<p>Your workspace is a place of honour, dignity, and a point where you earn money for yourself and your family. Never try to be personal in your workspace. Don&#8217;t discuss your emotions or fall for someone because that is unprofessional. Treat your workspace at your second home. Do joke around but don&#8217;t forget your limits. Staying within limits is the best way to stay in good character.</p>\n\n\n\n<h2 class=\"wp-block-heading\">You&#8217;re a team lead?</h2>\n\n\n\n<p>Do you have a team to lead? So, always start your week by knowing about your team by doing a 1:1 session with them so they can be comfortable with you and can discuss issues with you openly. Make your team feel like you&#8217;re a leader rather than a boss who has authority over them. It is important to understand what difficulties your team is facing so you need to start having that 1:1 with your team right away. As a manager, you are responsible for your team, so take responsibility and treat your team like your own family.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Avoid politics</h2>\n\n\n\n<p>Kindly, avoid politics at your workspace because that is something which never lets an employee/employer grow into something big. Avoid doing stuff which hurts the company&#8217;s growth or even a single team member&#8217;s growth. It is important to create a clean and pure environment in the company due to which you and the company can grow because you are a part of the company</p>\n\n\n\n<h2 class=\"wp-block-heading\">Be crystal clear</h2>\n\n\n\n<p>Always be clear about the problem, if you have a task you don&#8217;t understand, rather than nodding your head, speak and communicate with the relevant person so they can help you understand. Staying quiet about the problem will create another problem which might not be easy to solve. So, always be crystal clear about what you understand, what you know, and what you want.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Remote jobs sometimes are not easy but practice makes a person perfect and that is what is called experience. Follow the given points above and I hope you are good to go with your remote job. </p>\n","createdAt":"2022-11-16T04:46:09","excerpt":"<p>If you&#8217;re working remotely for a company, let me help you upgrade with some of the tips I have managed to learn over the last 4 years of remote work.</p>\n","id":"remote-work","slug":"remote-work","title":"Remote work?","modified":"2022-11-16T04:53:14","featuredImage":"https://arslanmushtaq.files.wordpress.com/2022/11/remotework_fi.jpeg"},{"content":"\n<p>You are new to remote work and successfully, you&#8217;ve got an interview and badly you have no idea what it&#8217;s gonna be? No issues, let me help you out when it comes to virtual interviews because I have gone through a lot</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Remote jobs are the new norm for people working in the software industry. So, how do you ace your interview when you have the skillset but you&#8217;re worried about how to communicate with the interviewer? Here are the things we are going to discuss within this article to help you become more comfortable towards giving your virtual interview.</p>\n\n\n\n<ol>\n<li>Fluency in English</li>\n\n\n\n<li>Your internet connection</li>\n\n\n\n<li>The surroundings and background</li>\n\n\n\n<li>Your portfolio</li>\n\n\n\n<li>Be confident</li>\n</ol>\n\n\n\n<h2 class=\"wp-block-heading\">Fluency in English</h2>\n\n\n\n<p>If you have applied for a job in the same country and the interview is in the native language you speak, then don&#8217;t worry about this section. Skip it, but if you are applying to companies like FAANG (Facebook, Apple, Amazon, Netflix, Google) or companies which require you to speak English and you are not a fluent English speaker, then leave everything and start learning and communicating in English because 90% of the international companies prefer candidates who speak fluent English and are able to define/solve a problem in English.</p>\n\n\n\n<p>If you are bad at speaking English then start taking an English course like Duolingo, IELTS or TOEFL. Start communicating with your friends in English, and watch English dramas to improve your hearing and understanding right choice of words.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Your internet connection</h2>\n\n\n\n<p>Do you have a bad internet connection? That is very bad for you because how embarrassing would it look when you&#8217;re so confident and suddenly the internet goes down or you have a bad/slow connection? Get a good internet connection because not every interviewer tolerates bad internet connectivity. For a remote job, it is essential to have a good internet connection.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The surroundings and background</h2>\n\n\n\n<p>While the interview is being conducted, kindly try to have a professional background rather than having kids running around or babes dancing in the background as that would not look professional enough. Blur your background or try using the background provided by the video call service so you look professional. </p>\n\n\n\n<p>Try to sit in a room alone until the interview is conducted so it doesn&#8217;t portray a bad image towards the interview thinking into someone is helping you during the interview which is equally bad if kids start screaming in the background. Just sit in a room alone where you don&#8217;t expect background noises to pop up during the interviews.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Your portfolio</h2>\n\n\n\n<p>Try to build a portfolio to portray your best work. The interviewer needs to understand what you&#8217;ve done. During your technical interview, discuss the details of your project. Help the interviewer understand how much effort you&#8217;ve put into a project(s).</p>\n\n\n\n<p>If you&#8217;re an experienced person then try to keep your portfolio updated along with the latest technologies to prove that you are up to date with the world discovering new things and you don&#8217;t like to stay behind. Prove yourself not by force, but by your actions/work.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Be confident</h2>\n\n\n\n<p>Whenever you go for an interview, you are representing what you know, and what you&#8217;ve worked with so be confident about what you know and don&#8217;t apply to jobs where the scope of learning is high. Companies prefer people who work and prove output. It is important to understand that during an interview it is compulsory to be confident about what you&#8217;re going to utter from your mouth. As you are going to present your professional side and the work you&#8217;re good at then you shouldn&#8217;t be confident by meaningless questions like <em>&#8220;What would happen if I forgot something while the interview&#8221;</em> or &#8220;I hope the interviewer doesn&#8217;t say anything to me during the interview&#8221;.</p>\n\n\n\n<p>Interviews are conducted to measure the skillset based on the position applied, so if you&#8217;ve applied for that position after reading the job description and responsibilities then you should be confident enough to communicate with the interviewer.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>These were some of the points which will help you ace the basics of the interview. One more tip before we end this always learn about the company by visiting its website and social media. The more prepared you are, the more your chances are to be selected.</p>\n","createdAt":"2022-11-16T03:55:47","excerpt":"<p>You are new to remote work and successfully, you&#8217;ve got an interview and badly you have no idea what it&#8217;s gonna be? No issues, let me help you out when it comes to virtual interviews because I have gone through a lot</p>\n","id":"ace-your-virtual-interview","slug":"ace-your-virtual-interview","title":"Ace your virtual&nbsp;interview","modified":"2022-11-16T03:55:47","featuredImage":"https://arslanmushtaq.files.wordpress.com/2022/11/aceyourvirtualinterview_fi.jpeg"},{"content":"\n<p>So, you&#8217;ve decided to become a software developer. You are puzzled about the pathway to becoming one with such fears in your mind like where to start, whether is it difficult and how long is it going to take.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<h2 class=\"wp-block-heading\">Understand this first!</h2>\n\n\n\n<p>Before we dive into the solution to the problem, it&#8217;s essential to understand the skill you&#8217;re looking to develop. The world of software development is very vast, a lot. The development of web applications, mobile applications, video games, console applications, and so much more but let&#8217;s not confuse you more. You need to pick one to start. Here is a simplified version to understand how software development works:</p>\n\n\n\n<figure class=\"wp-block-table is-style-regular\"><table><tbody><tr><th><strong>Stack</strong></th><th><strong>Platforms</strong></th><th><strong>Platform</strong></th><th><strong>Technology Stack</strong></th></tr><tr><td class=\"has-text-align-left\" data-align=\"left\">Frontend</td><td>Mobile, Web, and Desktop</td><td>Android, iOS, Web, PS4/PS5, Windows, MacOS, and many more</td><td>ReactJS, Angular, VueJS, React Native, Flutter, Unity, Unreal Engine, and many more&#8230;</td></tr><tr><td class=\"has-text-align-left\" data-align=\"left\">Backend</td><td>Server Side Management, Database Development and much more </td><td>Backend Development can be done for all platforms</td><td>NodeJS, Django, Ruby on Rails, Spring Boot, Laravel, .NET Core, Flask and many more&#8230;</td></tr></tbody></table></figure>\n\n\n\n<h2 class=\"wp-block-heading\">Frontend and Backend in simple words</h2>\n\n\n\n<p>In simple words, creating interaction on the web, mobile or a platform where interaction is possible is called frontend. Structuring, managing, and manipulating data happen on the backend.</p>\n\n\n\n<h2 class=\"wp-block-heading\">What matters?</h2>\n\n\n\n<p>What matters is what you like to do. Ask yourself if you&#8217;re even interested in building something new. Then ask yourself whether you want to develop something physically or digitally. Do you want to build something digitally? Right? Then you&#8217;re on the right path. Then the next question is what do you want to build? Video games, mobile applications or web applications or something that fits the software development criteria.</p>\n\n\n\n<p>After you&#8217;ve selected what you&#8217;re willing to build and change the world, start with research on that technology (Kindly, don&#8217;t start a research paper 🙄). Let&#8217;s take my example here, I wanted to build mobile applications from the start as I was very much inspired by them. I started with Android Development and I researched how can I build mobile applications with Android. Then I came to know about programming and I wrote my first piece of code in Java.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Overcoming your fears</h2>\n\n\n\n<p>I don&#8217;t wanna take your time and educate you about things you might know better than me. Here are oneliners for all your fears:</p>\n\n\n\n<h3 class=\"wp-block-heading\">Where?</h3>\n\n\n\n<p><strong><strong>You start with research.</strong>&nbsp;</strong>There are enormous resources on the web to get started. For example, to get started with programming there are so many channels on <a href=\"https://www.youtube.com/results?search_query=programming+fundamentals\" target=\"_blank\" rel=\"noreferrer noopener\">YouTube</a> which can help you understand the fundamentals of programming and if you&#8217;re willing to pay and learn then there is <a href=\"https://www.udemy.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Udemy</a>, <a href=\"http://coursera.org/\" target=\"_blank\" rel=\"noreferrer noopener\">Coursera</a>, <a href=\"https://linkedin.com/learning\" target=\"_blank\" rel=\"noreferrer noopener\">LinkedIn Learning</a>, and many many more.</p>\n\n\n\n<h3 class=\"wp-block-heading\">When?</h3>\n\n\n\n<p>Just start now, there is no need to finish things within a single sitting. Break them down into goals, and set your time to learn and practice.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Too Difficult?</h3>\n\n\n\n<p>If you think it&#8217;s too difficult, then try to find a guide, or mentor or expand your learning and practice time.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>At the end of the day, I would suggest doing something rather than planning, thinking, or even discussing it. Just take the leap of learning and practising and you&#8217;re good to go.</p>\n\n\n\n<p></p>\n","createdAt":"2022-11-13T20:04:06","excerpt":"<p>Are you struggling with the fear of becoming a software developer? Or you&#8217;re confused and puzzled to the core and have started procrastinating over the decision to start or not? Then this article is for you.</p>\n","id":"becoming-a-software-developer","slug":"becoming-a-software-developer","title":"Becoming a software&nbsp;developer?","modified":"2022-11-13T22:42:22","featuredImage":"https://arslanmushtaq.files.wordpress.com/2022/11/featured-image-3.jpeg"}]