[
  {
    "id": "amega",
    "title": "Lead Frontend Engineer",
    "company": "Amega, Cyprus",
    "location_type": "Remote",
    "start_date": "June 2024",
    "end_date": "November 2025",
    "achievements": [
      "Owned and defined the mobile and frontend architecture across React Native and web platforms, serving as the primary technical decision-maker for performance, scalability, and tooling strategy.",
      "Led the frontend ecosystem across multiple products, delivering performance-optimized features used across customer-facing financial applications.",
      "Designed and implemented a unified automation framework using Appium and WebDriverIO, reducing manual QA effort by 30% and standardizing testing practices organization-wide.",
      "Architected and improved CI/CD pipelines, reducing deployment time by 20% while increasing release reliability and environment consistency.",
      "Led and mentored a team of 5 engineers, conducting architecture reviews, code reviews, and technical coaching.",
      "Collaborated closely with Product, Backend, and QA teams to deliver stable, scalable features under aggressive timelines."
    ]
  },
  {
    "id": "novos",
    "title": "Senior React Native Engineer",
    "company": "Novos, United States of America",
    "location_type": "Remote",
    "start_date": "April 2023",
    "end_date": "June 2024",
    "achievements": [
      "Led architectural decisions for a large-scale React Native application supporting 1M+ users, focusing on performance optimization, scalability, and reliability.",
      "Delivered high-impact mobile features contributing to a 30% increase in traffic and 15% growth in e-commerce revenue.",
      "Implemented performance and stability strategies that significantly improved app responsiveness and crash rates.",
      "Worked cross-functionally with Product, Backend, and Design teams to translate business requirements into scalable mobile solutions."
    ]
  },
  {
    "id": "s4-digital",
    "title": "Senior React Native Engineer",
    "company": "S4 Digital, Pakistan",
    "location_type": "Remote",
    "start_date": "October 2021",
    "end_date": "March 2023",
    "achievements": [
      "Established and enforced end-to-end testing standards for mobile applications, increasing E2E coverage from 45% to 96%.",
      "Contributed to architectural improvements and feature delivery, resulting in a 3% increase in application traffic.",
      "Led localization and release enhancements that drove an 8% increase in engagement from diverse user regions."
    ]
  },
  {
    "id": "ecologix",
    "title": "Associate React Native Engineer (De facto Technical Lead)",
    "company": "Ecologix, Pakistan",
    "location_type": "On-site",
    "start_date": "September 2020",
    "end_date": "August 2021",
    "achievements": [
      "Delivered production mobile applications across the full lifecycle from architecture and development to deployment and maintenance.",
      "Functioned as de facto technical lead for mobile projects, coordinating delivery across teams of 8–12 developers.",
      "Drove company revenue growth by delivering client projects and securing ongoing maintenance contracts, increasing monthly revenue from $0 to $18,000.",
      "Mentored junior and mid-level engineers, directly impacting delivery velocity and quality."
    ]
  },
  {
    "id": "juice-phactree",
    "title": "React Native Engineer",
    "company": "Juice Phactree, Canada",
    "location_type": "Remote",
    "start_date": "September 2015",
    "end_date": "August 2020",
    "achievements": [
      "Built and delivered mobile applications for multiple clients, contributing to the expansion of the company’s client portfolio.",
      "Increased quarterly revenue from 8,000 CAD to 33,000 CAD through successful delivery and long-term client engagement.",
      "Collaborated cross-functionally with marketing and sales teams to support product growth initiatives."
    ]
  }
]
