[
  {
    "id": "0",
    "title": "Lead Frontend Developer",
    "company": "Novos, USA",
    "location_type": "Remote",
    "start_date": "April 2023",
    "end_date": "June 2024",
    "responsibilities": [
      "Organized team activities efficiently using Monday",
      "Led the development and maintenance of mobile app infrastructure, utilizing Notion, Figma, and Terraform.",
      "Crafted mobile applications proficiently with React Native, incorporating Redux, Redux RTK Query, and TypeScript.",
      "Enhanced productivity by integrating Jenkins, App Center, and GitHub Actions for CI/CD.",
      "Ensured application robustness through comprehensive end-to-end testing frameworks like jest and detox.",
      "Enforced rigorous coding standards with ESlint and Prettier.",
      "Established design guidelines in Figma for UI/UX consistency.",
      "Applied Agile methodologies effectively for mobile app success."
    ]
  },
  {
    "id": "1",
    "title": "Senior React Native Developer",
    "company": "S4 Digital, Belgium",
    "location_type": "Remote",
    "start_date": "October 2021",
    "end_date": "March 2023",
    "responsibilities": [
      "Enhanced an existing mobile app through pair programming with fellow developers.",
      "Developed key features using React Native for the mobile application.",
      "Maintained code quality with Jest unit tests and Appium/Webdriver for end-to-end testing.",
      "Proactively addressed issues across environments using Bitrise, Dynatrace, and Instabug monitoring tools.",
      "Implemented efficient localization with Magnolia CMS.",
      "Facilitated debugging and troubleshooting with Sentry and React Native Debugger."
    ]
  },
  {
    "id": "2",
    "title": "Associate React Native Developer",
    "company": "Ecologix, Pakistan",
    "location_type": "On-site",
    "start_date": "September 2020",
    "end_date": "September 2021",
    "responsibilities": [
      "Constructed client-tailored mobile applications using React Native.",
      "Developed full-stack applications integrated with React Native using Google Firebase.",
      "Optimized development processes with cutting-edge JavaScript ES6 techniques.",
      "Oversaw a team of two junior members, fostering collaboration and productivity.",
      "Managed client requirements effectively, ensuring seamless communication and satisfaction."
    ]
  },
  {
    "id": "3",
    "title": "React Native Developer",
    "company": "Juice Phactree, Canada",
    "location_type": "Remote",
    "start_date": "September 2015",
    "end_date": "August 2020",
    "responsibilities": [
      "Transitioned from Native Android Developer to React Native framework.",
      "Integrated popular React Native libraries and third-party APIs.",
      "Managed end-to-end mobile app lifecycle, from development to deployment.",
      "Solely responsible for the mobile application's architecture and codebase.",
      "Provided technical support and troubleshooting for mobile applications."
    ]
  }
]
